EDTMKERPNEW.Разработка/src/InformationRegisters/Разр_ЯрлыкиКоробов/Разр_ЯрлыкиКоробов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>Разр_ЯрлыкиКоробов</name>
  <resources>
    <name>Штрихкод</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>40</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>Напечатан</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>Отгружен</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>Стерилизован</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>Перемещен</name>
    <type>
      <types>DocumentRef.ПередачаТоваровХранителю</types>
    </type>
  </resources>
  <attributes>
    <name>Автор</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ЭтапПроизводства</name>
    <type>
      <types>DocumentRef.ЭтапПроизводства2_2</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Серия</name>
    <type>
      <types>CatalogRef.СерииНоменклатуры</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Номер</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>6</precision>
      </numberQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

EDTMKERPNEW.Разработка/src/Documents/ПередачаТоваровХранителю/ПередачаТоваровХранителю.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="c7c0ead6-40db-47cd-85f3-e065d7c82f48">
  <name>ПередачаТоваровХранителю</name>
  <objectBelonging>Adopted</objectBelonging>
  <attributes extendedConfigurationObject="6f74f153-4769-4d47-85fb-0c8b236b71af">
    <name>ПеревозчикПартнер</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="1c4a9191-1a55-438f-8d8a-7521137a6d6d">
    <name>АдресДоставки</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>500</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="c34ac0af-a5e9-4320-82f6-f9b31b4c6793">
    <name>Партнер</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="6fec988c-b6d7-4822-bc8a-2bcebc98bbd8">
    <name>ЗонаДоставки</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="6eead0a5-6f6a-46bf-8844-8f1944b7dcaa">
    <name>Склад</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="25f3a135-7820-41db-831f-d6e6d987a2a4">
    <name>ПередачаПоЗаказам</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="63676004-c694-4546-b2aa-2a233b3835f5">
    <name>ЗаказКлиента</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="7010dedc-b312-4320-b4c9-8fbb473d8133">
    <name>Контрагент</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="9c2b0695-e6b1-48d9-ac97-7d5270873495">
    <name>Соглашение</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="a55bdb4e-bf3e-42df-a984-188dda0c6837">
    <name>ХозяйственнаяОперация</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="b1968918-6d39-439f-b406-cc078a0e06a4">
    <name>Организация</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="b2e3b9d8-996f-4aeb-8c14-cb028360a4b4">
    <name>Комментарий</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="0b72e7b9-e43a-47fc-afc9-6057cb5e53ec">
    <name>Договор</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="160761db-7fd5-4f46-bfaf-f90ae8c96612">
    <name>ВремяДоставкиС</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <dateQualifiers>
          <dateFractions>Time</dateFractions>
        </dateQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="18079968-cc7a-4f94-b893-8cf82c4e84f8">
    <name>СпособДоставки</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="01c008fb-22b7-4df6-8c5a-d26fcd900849">
    <name>ВремяДоставкиПо</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <dateQualifiers>
          <dateFractions>Time</dateFractions>
        </dateQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="ce3e66f8-84c6-4c6d-a897-f6d1b411fdff">
    <name>ДополнительнаяИнформацияПоДоставке</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="1491c559-7b0e-40df-a435-ef8bbbbd2b18">
    <name>ОсобыеУсловияПеревозки</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="a8edcaba-a6ca-47fa-9894-519aa0334baf">
    <name>ОсобыеУсловияПеревозкиОписание</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="5ac84b74-ce74-462b-9016-98a692b286e4">
    <name>АдресДоставкиПеревозчика</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>500</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="e31c60c9-d36f-40db-b4d0-0f86ec42404f">
    <name>Менеджер</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="0f7ba1df-7c8f-46ae-90ed-f3b4252f6efa">
    <name>Сделка</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="5b44517f-9fe5-40cb-9873-833ea12af645">
    <name>Подразделение</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="3de587c1-57bb-4e54-8172-4870f47f27c0">
    <name>КонтактноеЛицо</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="f46bf728-9471-436e-ba84-fb4accba4b14">
    <name>Автор</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="63f83cad-3214-4818-ba4a-cf01d7b1e5f7">
    <name>Валюта</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="64dc800f-b69f-42f2-a858-b8df407b539f">
    <name>НаправлениеДеятельности</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="aec5ec47-cebe-436f-a5df-624f48d700df">
    <name>ВернутьМногооборотнуюТару</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="b082df29-01c7-48b3-addb-db610bbaeec3">
    <name>ДатаВозвратаМногооборотнойТары</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <tabularSections extendedConfigurationObject="cf556c65-fe1f-4ae9-a843-17287f8a810d">
    <name>Товары</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes extendedConfigurationObject="42867ac0-e514-44f3-acb1-f5a57ebd05a3">
      <name>СрокПоставки</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>10</precision>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes extendedConfigurationObject="b3710b13-71c3-4c86-b21a-aee94bfa573a">
      <name>ВидЦены</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="a033e5d3-406a-47e3-a1b3-76c68c32ebaa">
      <name>Склад</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="82944117-5944-46ad-b45c-4a787f7db675">
      <name>ЗаказКлиента</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="1571eb11-b228-4191-bae3-6369a96f1eae">
      <name>Назначение</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="bda6c76b-c2c2-4841-83ca-1ef894aaace0">
      <name>Цена</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="4589ac9c-2e35-4bdf-a37c-44355cdd17ee">
      <name>КодСтроки</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>10</precision>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes extendedConfigurationObject="0dc27a0e-120c-41ad-9f86-b022a6468e98">
      <name>ХарактеристикаНабора</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="53f5d55e-fbb4-47c8-a767-064960e22e35">
      <name>Номенклатура</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="74ea739b-f67c-4ad0-b1f3-014384ac4532">
      <name>НоменклатураНабора</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="2569045d-51ee-4357-a23f-a5f404c75325">
      <name>Характеристика</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="cad05a06-cd33-4cc7-8ec7-8822f4489535">
      <name>НазначениеОтправителя</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="86168fd9-ac0b-41b0-8bad-588df1098e10">
      <name>СтатусУказанияСерий</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>2</precision>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes extendedConfigurationObject="9673ab19-498a-413a-a8ae-e063d277fbad">
      <name>Сумма</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="fe3ce907-bdab-443a-a451-939ce5cfea67">
      <name>Серия</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="b42f938b-a75d-420e-91cd-6012d0d04ebe">
      <name>КоличествоУпаковок</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>15</precision>
            <scale>3</scale>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes extendedConfigurationObject="e4d02c34-e005-4187-9e10-5f85e61c2e42">
      <name>Упаковка</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="5e44032e-b664-4277-98b2-3500c4b1c25e">
      <name>СтатусУказанияСерийНаСкладах</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>2</precision>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes extendedConfigurationObject="e50e1f98-68d4-4992-8b71-3ab1c8f21217">
      <name>АналитикаУчетаНоменклатуры</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
  </tabularSections>
  <tabularSections extendedConfigurationObject="b606ab50-37ce-4a3d-add5-14c13fac8574">
    <name>ВидыЗапасов</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes extendedConfigurationObject="e432ec7f-0340-42b8-bc1b-2e4338753167">
      <name>ИдентификаторСтроки</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <stringQualifiers>
            <length>36</length>
          </stringQualifiers>
        </typeExtension>
      </extension>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Разр_Штрихкоды</name>
    <attributes>
      <name>Штрихкод</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>40</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections extendedConfigurationObject="276f2301-4595-4f03-9f7b-72ef1ec90f16">
    <name>Серии</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes extendedConfigurationObject="9a2a4466-e298-4499-9b99-166649dbed06">
      <name>Серия</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="f9049da2-b05b-44da-a0e2-323c4bb438ff">
      <name>Количество</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>15</precision>
            <scale>3</scale>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes extendedConfigurationObject="eacbc416-9d77-47b2-a942-938edcc65cb0">
      <name>Номенклатура</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="fbf42fc3-37da-496e-a65e-0c569af7279b">
      <name>Характеристика</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="d3fc4921-ccfe-45a5-800b-e4ca7d801b77">
      <name>Назначение</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="efca583d-7f78-47bc-9308-25a6fbf9992a">
      <name>НазначениеОтправителя</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="50dbede1-0412-4840-beef-6d8c9c647cfc">
      <name>Склад</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
  </tabularSections>
</mdclass:Document>

EDTMKERPNEW.Разработка/src/CommonModules/Разр_ЗаполнениеТЧПоЯрлыкамСервер/Module.bsl
Функция НайтиХарактеристикуПоВидуНоменклатуры(
	НаименованиеВидаНоменклатуры,
	НаименованиеХарактеристики
	) Экспорт
	
	НаименованиеВидаНоменклатуры = СокрЛП(Строка(НаименованиеВидаНоменклатуры));
	НаименованиеХарактеристики = СокрЛП(Строка(НаименованиеХарактеристики));
	
	Если ПустаяСтрока(НаименованиеВидаНоменклатуры)
		Или ПустаяСтрока(НаименованиеХарактеристики) Тогда
		
		Возврат Справочники.ХарактеристикиНоменклатуры.ПустаяСсылка();
		
	КонецЕсли;
	
	ВидНоменклатуры = Справочники.ВидыНоменклатуры.НайтиПоНаименованию(
	НаименованиеВидаНоменклатуры,
	Истина
	);
	
	Если Не ЗначениеЗаполнено(ВидНоменклатуры) Тогда
		Возврат Справочники.ХарактеристикиНоменклатуры.ПустаяСсылка();
	КонецЕсли;
	
	Характеристика = Справочники.ХарактеристикиНоменклатуры.НайтиПоНаименованию(
	НаименованиеХарактеристики,
	Истина,
	Неопределено,
	ВидНоменклатуры
	);
	
	Возврат Характеристика;
	
КонецФункции

Функция ПолучитьХарактеристикуСтерильно() Экспорт
	
	Возврат НайтиХарактеристикуПоВидуНоменклатуры(
	"Продукция стерильная",
	"Стерильно"
	);
	
КонецФункции

Функция ПолучитьХарактеристикуНаСтерилизацию() Экспорт
	
	Возврат НайтиХарактеристикуПоВидуНоменклатуры(
	"Продукция стерильная",
	"На стерилизацию"
	);
	
КонецФункции

Функция СтруктураИзВыборки(РезультатЗапроса, Выборка, Результат)  Экспорт
	
	Для Каждого Колонка Из РезультатЗапроса.Колонки Цикл
		Результат.Вставить(
		Колонка.Имя,
		Выборка[Колонка.Имя]
		);
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

Процедура ПроведениеПоШтрихкодам(Источник, Отказ, РежимПроведения) Экспорт
	Если Не Отказ ТОгда
		ИмяРесурса = "";
		Если ТипЗнч(Источник)= Тип("ДокументОбъект.ПередачаТоваровХранителю") ТОгда
			ИмяРесурса = "ПереданПереработчику";
		ИначеЕсли ТипЗнч(Источник)= Тип("ДокументОбъект.ОтчетПереработчика2_5") ТОгда
			ИмяРесурса = "Стерилизован";
		ИначеЕсли ТипЗнч(Источник)= Тип("ДокументОбъект.ДвижениеПродукцииИМатериалов") ТОгда
			ИмяРесурса = "Передвинут";
		ИначеЕсли ТипЗнч(Источник)= Тип("ДокументОбъект.ПеремещениеТоваров") ТОгда
			ИмяРесурса = "Перемещен";
		ИначеЕсли ТипЗнч(Источник)= Тип("ДокументОбъект.ПересчетТоваров") ТОгда
			ИмяРесурса = "Пересчитан";
		ИначеЕсли ТипЗнч(Источник)= Тип("ДокументОбъект.УпаковочныйЛист") ТОгда
			ИмяРесурса = "Упакован";
		ИначеЕсли ТипЗнч(Источник)= Тип("ДокументОбъект.РеализацияТоваровУслуг") ТОгда
			ИмяРесурса = "Отгружен";
		КонецЕсли;	
		
		Если ИмяРесурса <> "" ТОгда
			Запрос = Новый Запрос;
			Запрос.Текст = 
			"ВЫБРАТЬ
			|	Штрихкоды.Штрихкод КАК Штрихкод
			|ПОМЕСТИТЬ ВТ1
			|ИЗ
			|	&Штрихкоды КАК Штрихкоды
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	Разр_ЯрлыкиКоробовСрезПоследних.Номенклатура КАК Номенклатура,
			|	Разр_ЯрлыкиКоробовСрезПоследних.ЭтапПроизводства КАК ЭтапПроизводства,
			|	Разр_ЯрлыкиКоробовСрезПоследних.Серия КАК Серия,
			|	Разр_ЯрлыкиКоробовСрезПоследних.Номер КАК Номер,
			|	Разр_ЯрлыкиКоробовСрезПоследних.Штрихкод КАК Штрихкод,
			|	&Ссылка КАК ДокументДвижения
			|ПОМЕСТИТЬ ВТ2
			|ИЗ
			|	ВТ1 КАК ВТ1
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.Разр_ЯрлыкиКоробов.СрезПоследних(
			|				,
			|				ТИПЗНАЧЕНИЯ(ДокументДвижения) = ТИП(Документ.ЭтапПроизводства2_2)
			|					И Напечатан) КАК Разр_ЯрлыкиКоробовСрезПоследних
			|		ПО ВТ1.Штрихкод = Разр_ЯрлыкиКоробовСрезПоследних.Штрихкод
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	ВТ2.Номенклатура КАК Номенклатура,
			|	ВТ2.ЭтапПроизводства КАК ЭтапПроизводства,
			|	ВТ2.Серия КАК Серия,
			|	ВТ2.Номер КАК Номер,
			|	ВТ2.Штрихкод КАК Штрихкод,
			|	ВТ2.ДокументДвижения КАК ДокументДвижения
			|ИЗ
			|	ВТ2 КАК ВТ2
			|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.Разр_ЯрлыкиКоробов.СрезПоследних(, ДокументДвижения = &ССылка) КАК Разр_ЯрлыкиКоробовСрезПоследних
			|		ПО ВТ2.Номенклатура = Разр_ЯрлыкиКоробовСрезПоследних.Номенклатура
			|			И ВТ2.ЭтапПроизводства = Разр_ЯрлыкиКоробовСрезПоследних.ЭтапПроизводства
			|			И ВТ2.Серия = Разр_ЯрлыкиКоробовСрезПоследних.Серия
			|			И ВТ2.Штрихкод = Разр_ЯрлыкиКоробовСрезПоследних.Штрихкод
			|			И (ВЫБОР
			|				КОГДА ТИПЗНАЧЕНИЯ(ВТ2.ДокументДвижения) = ТИП(Документ.ПередачаТоваровХранителю)
			|					ТОГДА Разр_ЯрлыкиКоробовСрезПоследних.ПереданПереработчику
			|				КОГДА ТИПЗНАЧЕНИЯ(ВТ2.ДокументДвижения) = ТИП(Документ.ОтчетПереработчика2_5)
			|					ТОГДА Разр_ЯрлыкиКоробовСрезПоследних.Стерилизован
			|				КОГДА ТИПЗНАЧЕНИЯ(ВТ2.ДокументДвижения) = ТИП(Документ.РеализацияТоваровУслуг)
			|					ТОГДА Разр_ЯрлыкиКоробовСрезПоследних.Отгружен
			|				КОГДА ТИПЗНАЧЕНИЯ(ВТ2.ДокументДвижения) = ТИП(Документ.ПеремещениеТоваров)
			|					ТОГДА Разр_ЯрлыкиКоробовСрезПоследних.Перемещен
			|				КОГДА ТИПЗНАЧЕНИЯ(ВТ2.ДокументДвижения) = ТИП(Документ.ПересчетТоваров)
			|					ТОГДА Разр_ЯрлыкиКоробовСрезПоследних.Пересчитан
			|				КОГДА ТИПЗНАЧЕНИЯ(ВТ2.ДокументДвижения) = ТИП(Документ.УпаковочныйЛист)
			|					ТОГДА Разр_ЯрлыкиКоробовСрезПоследних.Упакован
			|				КОГДА ТИПЗНАЧЕНИЯ(ВТ2.ДокументДвижения) = ТИП(Документ.ДвижениеПродукцииИМатериалов)
			|					ТОГДА Разр_ЯрлыкиКоробовСрезПоследних.Передвинут
			|			КОНЕЦ)
			|ГДЕ
			|	Разр_ЯрлыкиКоробовСрезПоследних.Номенклатура ЕСТЬ NULL";
			
			Запрос.Параметры.Вставить("Штрихкоды",Источник.Разр_Штрихкоды.Выгрузить());
			Запрос.Параметры.Вставить("Ссылка", Источник.Ссылка);
			РезультатЗапроса = Запрос.Выполнить();
			
			ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
			
			Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
				ЗаписьРС = РегистрыСведений.Разр_ЯрлыкиКоробов.СоздатьМенеджерЗаписи();
				ЗаполнитьЗначенияСвойств(ЗаписьРС,ВыборкаДетальныеЗаписи);
				ЗаписьРС.Период = ТекущаяДатаСеанса();
				ЗаписьРС.ДокументДвижения = Источник.Ссылка;
				ЗаписьРС[ИмяРесурса] = Истина;
				ЗаписьРС.Автор = ПараметрыСеанса.ТекущийПользователь;
				ЗаписьРС.Записать();
			КонецЦикла;
		КонецЕсли;
	КонецЕсли;	
КонецПроцедуры

Процедура ОтменаПроведенияПоШтрихкодам(Источник, Отказ) Экспорт
	Если Не Отказ ТОгда
		//ИмяРесурса = "";
		//Если ТипЗнч(Источник)= Тип("ДокументОбъект.ПередачаТоваровХранителю") ТОгда
		//	ИмяРесурса = "Напечатан";
		//ИначеЕсли ТипЗнч(Источник)= Тип("ДокументОбъект.ОтчетПереработчика2_5") ТОгда
		//	ИмяРесурса = "ПереданПереработчику";
		//ИначеЕсли ТипЗнч(Источник)= Тип("ДокументОбъект.ПересчетТоваров") ТОгда
		//	ИмяРесурса = "Стерилизован";
		//ИначеЕсли ТипЗнч(Источник)= Тип("ДокументОбъект.ПеремещениеТоваров") ТОгда
		//	ИмяРесурса = "Пересчитан";	
		//	//ИначеЕсли ТипЗнч(Источник)= Тип("ДокументОбъект.ДвижениеПродукцииИМатериалов") ТОгда
		//	//	ИмяРесурса = "Передвинут";		
		//ИначеЕсли ТипЗнч(Источник)= Тип("ДокументОбъект.УпаковочныйЛист") ТОгда
		//	ИмяРесурса = "Пересчитан";
		//ИначеЕсли ТипЗнч(Источник)= Тип("ДокументОбъект.РеализацияТоваровУслуг") ТОгда
		//	ИмяРесурса = "Упакован";
		//КонецЕсли;	
		
		//Если ИмяРесурса <> "" ТОгда
			Запрос = Новый Запрос;
			Запрос.Текст = 
			"ВЫБРАТЬ
			|	Штрихкоды.Штрихкод КАК Штрихкод
			|ПОМЕСТИТЬ ВТ1
			|ИЗ
			|	&Штрихкоды КАК Штрихкоды
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	Разр_ЯрлыкиКоробовСрезПоследних.Номенклатура КАК Номенклатура,
			|	Разр_ЯрлыкиКоробовСрезПоследних.ЭтапПроизводства КАК ЭтапПроизводства,
			|	Разр_ЯрлыкиКоробовСрезПоследних.Серия КАК Серия,
			|	Разр_ЯрлыкиКоробовСрезПоследних.Номер КАК Номер,
			|	Разр_ЯрлыкиКоробовСрезПоследних.Штрихкод КАК Штрихкод,
			|	&Ссылка КАК ДокументДвижения
			|ПОМЕСТИТЬ ВТ2
			|ИЗ
			|	ВТ1 КАК ВТ1
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.Разр_ЯрлыкиКоробов.СрезПоследних(
			|				,
			|				ТИПЗНАЧЕНИЯ(ДокументДвижения) = ТИП(Документ.ЭтапПроизводства2_2)
			|					И Напечатан) КАК Разр_ЯрлыкиКоробовСрезПоследних
			|		ПО ВТ1.Штрихкод = Разр_ЯрлыкиКоробовСрезПоследних.Штрихкод
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	ВТ2.Номенклатура КАК Номенклатура,
			|	ВТ2.ЭтапПроизводства КАК ЭтапПроизводства,
			|	ВТ2.Серия КАК Серия,
			|	ВТ2.Номер КАК Номер,
			|	ВТ2.Штрихкод КАК Штрихкод,
			|	ВТ2.ДокументДвижения КАК ДокументДвижения,
			|	Разр_ЯрлыкиКоробовСрезПоследних.Напечатан КАК Напечатан,
			|	Разр_ЯрлыкиКоробовСрезПоследних.ПереданПереработчику КАК ПереданПереработчику,
			|	Разр_ЯрлыкиКоробовСрезПоследних.Стерилизован КАК Стерилизован,
			|	Разр_ЯрлыкиКоробовСрезПоследних.Отгружен КАК Отгружен,
			|	Разр_ЯрлыкиКоробовСрезПоследних.Перемещен КАК Перемещен,
			|	Разр_ЯрлыкиКоробовСрезПоследних.Пересчитан КАК Пересчитан,
			|	Разр_ЯрлыкиКоробовСрезПоследних.Упакован КАК Упакован,
			|	Разр_ЯрлыкиКоробовСрезПоследних.Передвинут КАК Передвинут
			|ИЗ
			|	ВТ2 КАК ВТ2
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.Разр_ЯрлыкиКоробов.СрезПоследних(
			|				,
			|				ВЫБОР
			|					КОГДА ТИПЗНАЧЕНИЯ(ДокументДвижения) = ТИП(Документ.ПередачаТоваровХранителю)
			|						ТОГДА ДокументДвижения = &ССылка
			|								И (Напечатан
			|									ИЛИ ПереданПереработчику)
			|					КОГДА ТИПЗНАЧЕНИЯ(ДокументДвижения) = ТИП(Документ.ОтчетПереработчика2_5)
			|						ТОГДА ДокументДвижения = &ССылка
			|								И (ПереданПереработчику
			|									ИЛИ Стерилизован)
			|				КОНЕЦ) КАК Разр_ЯрлыкиКоробовСрезПоследних
			|		ПО ВТ2.Номенклатура = Разр_ЯрлыкиКоробовСрезПоследних.Номенклатура
			|			И ВТ2.ЭтапПроизводства = Разр_ЯрлыкиКоробовСрезПоследних.ЭтапПроизводства
			|			И ВТ2.Серия = Разр_ЯрлыкиКоробовСрезПоследних.Серия
			|			И ВТ2.Штрихкод = Разр_ЯрлыкиКоробовСрезПоследних.Штрихкод";
			
			Запрос.Параметры.Вставить("Штрихкоды",Источник.Разр_Штрихкоды.Выгрузить());
			Запрос.Параметры.Вставить("Ссылка", Источник.Ссылка);
			
			РезультатЗапроса = Запрос.Выполнить();
			
			ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
			
			Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
				ЗаписьРС = РегистрыСведений.Разр_ЯрлыкиКоробов.СоздатьМенеджерЗаписи();
				ЗаполнитьЗначенияСвойств(ЗаписьРС,ВыборкаДетальныеЗаписи);
				ЗаписьРС.Период = ТекущаяДатаСеанса();
				ЗаписьРС.ДокументДвижения = Источник.Ссылка;
				//ЗаписьРС[ИмяРесурса] = Истина;
				ЗаписьРС.Автор = ПараметрыСеанса.ТекущийПользователь;
				ЗаписьРС.Записать();
			КонецЦикла;			
		//КонецЕсли;
	КонецЕсли;	
КонецПроцедуры
